Revit 2027 API
FailuresAccessor.DeleteWarning Method
 Deletes one specific failure message of severity "Warning".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteWarning(
	FailureMessageAccessor failure
)
Public Sub DeleteWarning (
	failure As FailureMessageAccessor
)
public:
void DeleteWarning(
	FailureMessageAccessor^ failure
)
member DeleteWarning :
        failure : FailureMessageAccessor -> unit
Parameters
failure FailureMessageAccessor
 The accessor to the warning to be deleted.
Exceptions
Exception | Condition
ArgumentException |  failure has not been properly initialized. -or- Severity of failure is not FailureSeverity::Warning.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace